


admin_help_text = '''Вы получили данное сообщение, так как вы администратор и имеете доступ!

Подробная информация, как пользоваться ботом, находится тут: @Easy_TG_Shop_Bot
'''

admin_set_new_admin_help = '''
Добавить администратора очень просто!

Просто перешлите данное сообщение тому, кого хотите сделать администратором
Он должен перейти по ссылке ниже и всё!

! Важно !
Ссылка действует 1 час
Ссылка одноразовая
Переходя по ссылке вы соглашаетесь с <a href="https://designer-tg-bot.ru/соглашение">Пользовательским соглашением</a>


'''